#+OPTIONS: p:t author:Kun
#+Title: Emacs
#+SETUPFILE: /Users/iceonfire/.emacs.d/org-themes/src/imagine_light/imagine_light.theme
*** zsh fzf
    zsh-syntax-highlighting zsh-autosuggestions fzf 
    c-t, c-r
    [[https://medium.com/@ivanaugustobd/your-terminal-can-be-much-much-more-productive-5256424658e8]]
    #+begin_src shell
      sh -c "$(wget https://raw.github.com/ohmyzsh/ohmyzsh/master/tools/install.sh -O -)"
      git clone https://github.com/zsh-users/zsh-completions ${ZSH_CUSTOM:-~/.oh-my-zsh/custom}/plugins/zsh-completions
      git clone https://github.com/zsh-users/zsh-syntax-highlighting.git ${ZSH_CUSTOM:-~/.oh-my-zsh/custom}/plugins/zsh-syntax-highlighting
      git clone https://github.com/zsh-users/zsh-autosuggestions ${ZSH_CUSTOM:-~/.oh-my-zsh/custom}/plugins/zsh-autosuggestions
      git clone --depth 1 https://github.com/junegunn/fzf.git ~/.fzf && ~/.fzf/install
    #+end_src

    #+RESULTS:
    | Downloading | bin/fzf                                                   | ...          |             |                                 |                    |        |             |      |                |
    | -           | Found                                                     | in           | $PATH       |                                 |                    |        |             |      |                |
    | -           | Creating                                                  | symlink:     | bin/fzf     | ->                              | /usr/local/bin/fzf |        |             |      |                |
    | -           | Checking                                                  | fzf          | executable  | ...                             | 0.27.2             | !=     | 0.28.0      |      |                |
    | Archive:    | /var/folders/p8/fv723px131l93kgpm08xd8g80000gq/T//fzf.zip |              |             |                                 |                    |        |             |      |                |
    | inflating:  | fzf                                                       |              |             |                                 |                    |        |             |      |                |
    | -           | Checking                                                  | fzf          | executable  | ...                             | 0.28.0             |        |             |      |                |
    |             |                                                           |              |             |                                 |                    |        |             |      |                |
    | Generate    | /Users/iceonfire/.fzf.bash                                | ...          | OK          |                                 |                    |        |             |      |                |
    | Generate    | /Users/iceonfire/.fzf.zsh                                 | ...          | OK          |                                 |                    |        |             |      |                |
    |             |                                                           |              |             |                                 |                    |        |             |      |                |
    |             |                                                           |              |             |                                 |                    |        |             |      |                |
    | Update      | /Users/iceonfire/.bashrc:                                 |              |             |                                 |                    |        |             |      |                |
    | -           | [                                                         | -f           | ~/.fzf.bash | ]                               | &&                 | source | ~/.fzf.bash |      |                |
    | +           | Added                                                     |              |             |                                 |                    |        |             |      |                |
    |             |                                                           |              |             |                                 |                    |        |             |      |                |
    | Update      | /Users/iceonfire/.zshrc:                                  |              |             |                                 |                    |        |             |      |                |
    | -           | [                                                         | -f           | ~/.fzf.zsh  | ]                               | &&                 | source | ~/.fzf.zsh  |      |                |
    | +           | Added                                                     |              |             |                                 |                    |        |             |      |                |
    |             |                                                           |              |             |                                 |                    |        |             |      |                |
    | Finished.   | Restart                                                   | your         | shell       | or                              | reload             | config | file.       |      |                |
    | source      | ~/.bashrc                                                 | #            | bash        | (.bashrc                        | should             | be     | loaded      | from | .bash_profile) |
    | source      | ~/.zshrc                                                  | #            | zsh         |                                 |                    |        |             |      |                |
    |             |                                                           |              |             |                                 |                    |        |             |      |                |
    | Use         | uninstall                                                 | script       | to          | remove                          | fzf.               |        |             |      |                |
    |             |                                                           |              |             |                                 |                    |        |             |      |                |
    | For         | more                                                      | information, | see:        | https://github.com/junegunn/fzf |                    |        |             |      |                |

